#define LENGTH 100
//道岔

//轨道
//信号机X-L X-LU/XI-L XI-LU XI-U   ***
unsigned short dat5[LENGTH][2][3]={
{{43,47},{71,76,74}},   //{X-L,X-LU},{XI-L,XI-LU,XI-U},
{{183,188,186}},          //{{SI-L,SI-LU,SI-U}},   
{{199,204,202}},          //{{SII-L,SII-LU,SII-U}},
{{215,220,218}},          //{{SIII-L,SIII-LU,SIII-U}},
{{231,236,234}},          //{{SIV-L,SIV-LU,SIV-U}},
{{247,252,250}},          //{{S5-L,S5-LU,S5-U}},
{{263,268,266}},          //{{S6-L,S6-LU,S6-U}},
{{279,284,282}},          //{{S8-L,S8-LU,S8-U}},
{{45}},             //{{X-U}},
{{48}},       //{{X-UU}},
{{48}},                 //{{X-UU}},
{{48}},                 //{{X-UU}},  
{{48}},          //{{X-UU}},
{{48}},                 //{{X-UU}},
{{48}},                 //{{X-UU}},
{{15,19},{199,204,202}},    //{{SH-L,SH-LU},{SII-L,SII-LU,SII-U}},
{{71,76,74}},            //{{XI-L,XI-LU,XI-U}},
{{87,92,90}},           //{{XII-L,XII-LU,XII-U}},
{{103,108,106}},           //{{X3-L,X3-LU,X3-U}},
{{103,108,106}},           //{{X3-L,X3-LU,X3-U}},
{{119,124,122}},           //{{XIV-L,XIV-LU,XIV-U}},
{{135,140,138}},           //{{X5-L,X5-LU,X5-U}},
{{135,140,138}},           //{{X5-L,X5-LU,X5-U}},
{{151,156,154}},           //{{X6-L,X6-LU,X6-U}},      
{{167,172,170}},           //{{X8-L,X8-LU,X8-U}},
{{71,76,74}},            //{{XI-L,XI-LU,XI-U}},
{{87,92,90}},           //{{XII-L,XII-LU,XII-U}},
{{103,108,106}},           //{{X3-L,X3-LU,X3-U}},
{{119,124,122}},           //{{XIV-L,XIV-LU,XIV-U}},
{{135,140,138}},           //{{X5-L,X5-LU,X5-U}},
{{151,156,154}},           //{{X6-L,X6-LU,X6-U}},      
{{167,172,170}},           //{{X8-L,X8-LU,X8-U}},                       
{{20}},                   //{{SH-UU}},
{{17}},                //{{SH-U}},
{{20}},                   //{{SH-UU}},
{{20}},                   //{{SH-UU}},
{{20}},                   //{{SH-UU}},
{{20}},                   //{{SH-UU}},
{{20}},                   //{{SH-UU}},
{{6}},                   //{{SG-UU}},
{{6}},                //{{SG-UU}},
{{6}},                   //{{SG-UU}},
{{3}},                   //{{SG-U}},
{{6}},                   //{{SG-UU}},
{{6}},                //{{SG-UU}},
{{6}},                   //{{SG-UU}},
{{6}},                   //{{SG-UU}},
{{6}},                //{{SG-UU}},
{{6}},                   //{{SG-UU}},
};
//北京接车1 九龙接车2 北京发车3 九龙发车4 贡家台接车5 贡家台发车6
unsigned short dat4[LENGTH][2]={
{1,4},                //????????????
{3},
{3},
{3},
{3},
{3},
{3},
{3},
{1},
{1},
{1},
{1},
{1},
{1},
{1},
{2,3}, 
{6},
{6},
{6},
{6},
{6},
{6}, 
{6},
{6},
{6},           //?????????????
{4},
{4},
{4},
{4},
{4},
{4},
{4},
{2},
{2},
{2},
{2},
{2},
{2},
{2},
{5},
{5},
{5},
{5},
{5},
{5},
{5},
{5},
{5},
{5},
};
//语音播报 txt 行数   ***
unsigned short dat3[LENGTH]={
41,               //下行一道通过信号开放
101,              //上行一道发车信号开放
102,              //上行二道发车信号开放
103,              //上行3道发车信号开放
104,              //上行4道发车信号开放
105,              //上行5道发车信号开放
106,              //上行6道发车信号开放
108,              //上行8道发车信号开放
21,               //下行一道接车信号开放
22,               //下行二道接车信号开放
23,              //下行3道接车信号开放
24,                //下行4道接车信号开放 
25,               //下行5道接车信号开放
26,              //下行6道接车信号开放
28,                //下行8道接车信号开放 
142,               //上行二道通过信号开放
1,               //下行一道发车信号开放
2,               //下行二道发车信号开放 
3,                //下行3道发车信号开放
3,                //下行3道发车信号开放
4,               //下行4道发车信号开放 
5,               //下行5道发车信号开放 
5,               //下行5道发车信号开放 
6,                //下行6道发车信号开放
8,               //下行8道发车信号开放 
1,               //下行一道发车信号开放
2,               //下行二道发车信号开放
3,                //下行3道发车信号开放
4,               //下行4道发车信号开放
5,               //下行5道发车信号开放
6,                //下行6道发车信号开放
8,               //下行8道发车信号开放
121,                //上行一道接车信号开放 
122,                //上行二道接车信号开放 
123,                //上行3道接车信号开放 
124,                //上行4道接车信号开放 
125,                //上行5道接车信号开放 
126,                //上行6道接车信号开放 
128,                //上行8道接车信号开放 
121,                //上行一道接车信号开放
122,                //上行二道接车信号开放
123,                //上行3道接车信号开放
124,                //上行4道接车信号开放
124,                //上行4道接车信号开放
125,                //上行5道接车信号开放
126,                //上行6道接车信号开放
126,                //上行6道接车信号开放
128,                //上行8道接车信号开放
128                //上行8道接车信号开放
};

//***
#define CON_LENGTH 21             //[3]counter 4[daocha]  LENGTH修改，一般不变
unsigned short	conditon[CON_LENGTH][5]={
{519,201,1},//x1jg-h
{521,202,1},//x2jg
{523,203,1},//x3jg
{479,204,1},//xjz-H          X进站第一个区段IAG
{507,205},//x1lq-H
{503,206},//x2lq
{499,207},//x3lq
{513,211,2},//sh1jg
{517,212,2},//sh2jg
{497,213,2},//sh3jg
{439,214,2},//sjz-H       S进站第一个区段  8DG  //sg进站第一个区段？？ d2?
{529,215},//sH1lq
{527,216},//sH2lq
{525,217},//sH3lq
{511,211,5},//sg1jg
{515,212,5},//sg2jg
{495,213,5},//sg3jg
{475,214,5},//sgjz
{509,205,6},//xg1lq-H
{505,206,6},//xg2lq
{501,207,6},//xg3lq
	
};

unsigned short factor[7][4]={
	 {0},
	 {0,0,480},//xjz-b  X进站第一个区段IAG-B
	 {0,0,440},//sjz-b  S进站第一个区段8DG-B
	 {0,0,460},//scz-b  S出站最后一个区段（XF前一个区段） 3DG_B
	 {0,0,436},//xcz-b   X出站最后一个区段（SHF前一个区段）4DG-B
     {0,0,476},//xgz-b  XG进站第一个区段IVBG-B
	 {0,0,474}//xgz-b   XG出站最后一个区段（SHF前一个区段）IIIBG-B
         };
const unsigned char   s[2][30] =  {
	"邢家村",
"贡家台",};

unsigned short	conditon_can[][6]={
	//  id  packnum charnum posnum   xinhaoji
	//par
	//id 1-13
	//pacnum  0,1
	//charnum  conditon_can[num][2] 1/2/3/4/5/6/7
	//posnum   conditon_can[num][3] 0/1/2/3/4/5/6/7
	//xinhaoji  eg:1344  2311 811
	{0x0b,00,7,0,73},//73g
	//{0x0b,00,7,2,30},//30bg
	{0x0b,00,7,4,30},//30ag
	{0x0b,00,6,1,39},//39ag
	//{0x0b,00,6,3,39},//39bg
	{0x0b,00,6,5,59},//59g
	//{0x0b,00,4,0,2599},//2599
	{0x0b,00,3,1,2552},//2552
	{0x0b,00,3,3,2538},//2538
	{0x0b,00,2,0,2521},//2521 10
	{0x0b,00,2,2,2507},//2507
	//{0x0b,00,2,4,2592},//2592
	{0x0b,00,1,0,2573},//2573
	{0x0b,00,1,3,2547},//2547
	{0x0b,00,1,5,2533},//2533
	{0x11,00,1,0,2578},//2578
	{0x11,00,1,2,2566},//2566
	{0x11,00,1,4,2526},//2526
	//{0x11,00,1,6,42},//42bg
	{0x11,00,2,1,42},//42ag 20
	{0x11,00,2,3,56},//56g
	{0x11,00,2,5,66},//66g
	//{0x11,00,3,0,111},//ls1lqg
	{0x11,00,3,6,25},//25g
	{0x11,00,5,1,2561},//2561g
	{0x09,00,1,0,2512},//2512g
	//{0x0e,01,4,1,2604},//2604g
	//{0x0e,01,4,3,2587},//2587g
};
